vrp/vrp-suite.org
#+TITLE: VRP solver environment
#+AUTHOR: Fernando Rodriguez Flores
#+DATE 2018-07-29 
#+TODO: TODO BROKEN | DONE


* TODO Introduction
  In this section we'll add the introduction and a general description of the system.

* Literate programming configuration
  In this section will have the configuration of the literate programming environment.  So far we'll only have some snippets for the addition of source blocks.

  #+BEGIN_SRC elisp :results none
    (define-key org-mode-map (kbd "M-m M-o M-t")
      (lambda () (interactive)
        (let* ((yas? yas-minor-mode))
          (yas-minor-mode 1)                                           
          (insert "slobtt")
          (yas-expand)
          (yas-minor-mode (if yas? 1 0)))))
     (define-key org-mode-map (kbd "M-m M-o M-k")
      (lambda () (interactive)
        (let* ((yas? yas-minor-mode))
          (yas-minor-mode 1)                                           
          (insert "slnct")
          (yas-expand)
          (yas-minor-mode (if yas? 1 0)))))
    (define-key org-mode-map (kbd "M-m M-o M-w")
      (lambda () (interactive)
        (let* ((yas? yas-minor-mode))
          (yas-minor-mode 1)                                           
          (insert "slobntp")
          (yas-expand)
          (yas-minor-mode (if yas? 1 0)))))
     (define-key org-mode-map (kbd "M-m M-o M-g")
       (lambda () (interactive)
         (let* ((yas? yas-minor-mode))
           (yas-minor-mode 1)                                           
           (insert "vrpg")
           (yas-expand)
           (yas-minor-mode (if yas? 1 0)))))
     (define-key org-mode-map (kbd "M-m M-o M-c")
       (lambda () (interactive)
         (let* ((yas? yas-minor-mode))
           (yas-minor-mode 1)                                           
           (insert "vrpc")
           (yas-expand)
           (yas-minor-mode (if yas? 1 0)))))
  #+END_SRC

* Package definition

The first thing to do is to create the package we are going to be working in.

#+BEGIN_SRC lisp +n -r :results none :exports code :tangle ../src/vrp-package.lisp 
(defpackage :vrp
  (:use :cl-user :common-lisp)
  (:shadow random round)
  (:export with-basic-solution
           pp-solution
           bformat
           build-neighborhood-tree
           exhaustive-exploration
           then
           else))

(in-package :vrp)
#+END_SRC

We shadowed =random= because we'll be using an implementation independent random numbers generation, but I want this to be completely transparent to the users, who will be able to use =(random)= as if it were the "normal" =random=.
* The reproducible random-number-generation
** documentation
   We want our results to be reproducible, so we need a reproducible random numbers generation system.  This is done in this section.

   Actually, we are going to use the following code, that was taken from a portable random number generation library for common lisp.
