vrp/vrp-suite.org
***** tests
      #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp 
      (let* ((coords '((0 0) (1 2) (3 4) (5 6) (7 8) (9 1) (2 3) (4 5))))
        (format t "=============================
      Testing euclidean2d-distance:
      =============================~2%")
        (loop for c1 in '((0 0) (1 2))
              do (format t "From ~a:~%" c1)
              do (loop for c2 in (rest coords)
                       do (format t "  Euclidean2d-distance from ~a to ~a: ~a (~a)~%"
                                  c1 c2
                                  (euclidean2d-distance c1 c2)
                                  (sqrt
                                   (+ (expt (- (first c1) (first c2)) 2)
                                      (expt (- (second c1) (second c2)) 2)))))))
      #+END_SRC
*** make-distance-matrix
**** description
     In this section we write a function to create the distance matrix from a list of coordinates.  The idea is to receive a list with the coordinates and return a matrix with the distance between every pair of elements.  
**** code
      #+BEGIN_SRC lisp +n -r :results none :exports code :tangle ../src/vrp-utilities.lisp
      (defun make-distance-matrix (coordinates
                                   &optional
                                     (distance-function #'euclidean2d-distance))
        "Returns a distance matrix from a list with coordinates.
        `coordinates' is a list with the coordinates for which we want to compute the distances, and `distance-function' is a function to calculate the distance between two coordinates."
        (let* ((n (length coordinates))
               (matrix (make-array (list n n)
                                   :initial-element 0)))
          ;; ;; (format t "length: ~a, array: ~a~%" n matrix)
          (loop for c1 in coordinates
                for i1 from 0
                do (loop for c2 in coordinates
                         for i2 from 0
                         do (setf (aref matrix i1 i2)
                                  (funcall distance-function c1 c2))))
          ;; finally return the matrix
          matrix))
      #+END_SRC
**** tests
     #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp 
     (let* ((coords '((0 0) (1 2) (3 4) (5 6) (7 8) (9 1) (2 3) (4 5)))
            (manhattan-matrix
             (make-distance-matrix coords 'manhattan-distance))
            (euclidean2d-matrix
             (make-distance-matrix coords 'euclidean2d-distance))
            (n (length coords)))
       (format t "=============================
     Testing make-distance-matrix:
     =============================~2%")
       (format t "Manhattan-distance:~2%")
       (loop for i from 0 below n
             do (format t "  | ~2d" (aref manhattan-matrix i 0))
             do (loop for j from 1 below n
                      do (format t " ~2d" (aref manhattan-matrix i j)))
             do (format t " |~%"))
       (format t "~%Euclidean2d-distance:2~%")
       (loop for i from 0 below n
             do (format t "  | ~2d" (aref euclidean2d-matrix i 0))
             do (loop for j from 1 below n
                      do (format t " ~2d" (aref euclidean2d-matrix i j)))
             do (format t " |~%"))

       (format t "Checking the contents:~%")
       (loop for i from 0 below n
             for c1 in coords
             do (loop for j from 0 below n
                      for c2 in coords
                      do (check-= (aref manhattan-matrix i j)
                                  (manhattan-distance c1 c2)))))

  
     #+END_SRC
** Add the package definition to the tests file
   #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp 
   (in-package :vrp)
   #+END_SRC

** A file to load all the tangled files
   #+BEGIN_SRC lisp +n -r :results none :exports code :tangle ../src/vrp-load-files.lisp
     (dolist (f (list "src/vrp-package.lisp"
		      "src/vrp-utilities.lisp"
		      "src/vrp-random-number-generation.lisp"
		      "src/vrp-generic-functions.lisp"
		      "src/vrp-class-definition-macro.lisp"
		      "src/vrp-classes.lisp"
		      "src/vrp-moments.lisp"
		      "src/vrp-data.lisp"
		      "src/vrp-neighborhood-exploration-macros.lisp"
		      "src/vrp-neighborhood-simulation.lisp"
		      "src/vrp-neighborhood-operations.lisp"
		      "src/vrp-delta-cost.lisp"
		      ;;		      "src/vrp-search-strategies.lisp"

		      "src/neigh-configuration.lisp"
		      "src/neigh-utilities.lisp"     
		      "src/neigh-class-macros.lisp"
		      "src/neigh-classes.lisp"
		      "src/neigh-generic-functions.lisp"
		      "src/neigh-criterion.lisp"
		      "src/neigh-cardinality.lisp"
		      "src/neigh-indexer.lisp"
		      "src/neigh-compatibility.lisp"
		      "src/neigh-exploration.lisp"
		      "src/neigh-exploration-heuristics.lisp"
		      "src/neigh-strategies.lisp"

		      "src/neigh-statistics.lisp"

		      "src/eval-classes.lisp"
		      "src/eval-methods.lisp"
		      "src/eval-graph-builder.lisp"

		      "src/prefabs-classes.lisp"
		      "src/prefabs-functions.lisp"
		      "src/prefabs-tutorials.lisp"

		      "src/vrp-criteria.lisp"
		      "src/vrp-algorithms.lisp"
		      "data/vrp-data-a-n32-k5.lisp"
		      "data/vrp-data-a-n33-k5.lisp"
		      "data/vrp-data-a-n33-k6.lisp"
		      "data/vrp-data-a-n37-k5.lisp"
		      "data/vrp-data-a-n65-k9.lisp"
		      "data/vrp-data-a-n80-k10.lisp"
		      "data/vrp-data-f-n135-k7.lisp"

		      "data/neigh-data.lisp"
		      "src/neigh-algorithms.lisp"
))
       (format t "Loading ~a...~%" f)
       (load f))
   #+END_SRC
** Function in python to tangle really fast
   #+BEGIN_SRC python +n -r :results none :exports code :tangle ../src/vrp-py-babel-tangle.sh
#!/usr/bin/env python3
# -*- mode: python -**

import fileinput, os

dests = dict()
"""A dictionary associating absolute file names and file objects."""

counter = dict()
"""A dictionary associating file objects with count of emitted
lines."""

dest = None
"""The current "destination", a file object"""

buf = list()
"""Buffered lines from the current code block.  Buffering is required
because we need to drop leading spaces before writing to the file, and
full contents is required to determine the number of spaces to remove.
"""

def match_begin(line):
    """Read a single line and return a file object if it's a #+begin_src, None otherwise.

Also create corresponding entries in dests and counter if they don't already exist."""
    line = list(filter(
        len,
        line.lower().strip().split(" ")))

    if line and line[0] == "#+begin_src":
        try:
            beg = line.index(":tangle")
        except ValueError:
            return False

        dest = os.path.realpath(os.path.expanduser(line[beg+1]))
        if not dest in dests.keys():
            fo = open(dest, 'w')
            dests[dest] = fo
            counter[fo] = 0
        else:
            fo = dests[dest]
            # Org mode does this
            fo.write("\n")
            counter[fo] += 1

        return fo

def match_end(line):
    """Return True if line is a #+end_src"""
    return line.lower().strip().startswith("#+end_src")

def write_buffer(dest, buf):
    """Drop extra leading spaces from buf, then write to dest."""
    # First, count how many spaces on the left we must remove.
    min = 1000
    for line in buf:
        ls = len(line.lstrip()) # Left strip
        if ls: # Ignore empty lines
            spaces = len(line) - ls
            if spaces < min:
                min = spaces

    # Then write the buffer to the file, dropping the extra indent
    for line in buf:
        counter[dest] += 1
        # If the line is empty, dropping the leading space will drop
        # the terminal \n, and will suppress blank lines.  We don't
        # want this._
        dest.write(line[min:-1])
        dest.write('\n')

for line in fileinput.input():
    if dest:
        if match_end(line):
            write_buffer(dest, buf)
            buf = list()
            dest = None
        else:
            buf.append(line)
    else:
        dest = match_begin(line)

for fn, fo in dests.items():
    fo.close()
    fn = os.path.relpath(fn, ".")
    c = str(counter[fo])
    print("{0} {1} {2} lines".format(
        fn,
        "." * (70 - len(fn) - len(c)),
        c))
   #+END_SRC

** Emacs syntax highlight
   As the previous elements are syntactic sugar, the next emacs-lisp snippet tells the emacs' syntax-highlight mechanism to recognize them as such:

   #+BEGIN_SRC emacs-lisp :results none :exports code :tangle ../vrp-emacs-utils.el
(font-lock-add-keywords 'lisp-mode
 '(("(\\(defmacro!\\)" 1 font-lock-keyword-face)
   ("(defmacro! +\\([^ ]+\\)" 1 font-lock-function-name-face)
   ("(\\(defbehavior\\)" 1 font-lock-keyword-face)
   ("(defbehavior +\\([^ ]+\\)" 1 font-lock-function-name-face)
   ("(\\(then\\)" 1 font-lock-keyword-face)
   ("(\\(else\\)" 1 font-lock-keyword-face)
   ("(\\(the-following\\)" 1 font-lock-keyword-face)))
   #+END_SRC
** Emacs functions to tangle all but the tests
*** vrp-org-babel-tangle-collect-blocks-no-tests
**** description
     This function collects all the src blocks in the file except those that should be exported to the file passed in the arg excluded-file.

     It is taken from ob-tangle.el from org version 9.2.
**** code
   #+BEGIN_SRC emacs-lisp :results none :exports code :tangle ../vrp-emacs-utils.el
   (defun vrp-org-babel-tangle-collect-blocks-no-tests
       (&optional language tangle-file exclude-file)
     "Collect source blocks in the current Org file, excluding blocks
   tangled to exclude-file.
   Return an association list of source-code block specifications of
   the form used by `org-babel-spec-to-string' grouped by language.
   Optional argument LANGUAGE can be used to limit the collected
   source code blocks by language.  Optional argument TANGLE-FILE
   can be used to limit the collected code blocks by target file."
     (setq exclude-file (or exclude-file "../src/vrp-tests.lisp"))
     (let ((counter 0) last-heading-pos blocks)
       (org-babel-map-src-blocks (buffer-file-name)
         (let ((current-heading-pos
                (org-with-wide-buffer
                 (org-with-limited-levels (outline-previous-heading)))))
           (if (eq last-heading-pos current-heading-pos) (cl-incf counter)
             (setq counter 1)
             (setq last-heading-pos current-heading-pos)))
         (unless (org-in-commented-heading-p)
           (let* ((info (org-babel-get-src-block-info 'light))
                  (src-lang (nth 0 info))
                  (src-tfile (cdr (assq :tangle (nth 2 info)))))
             (unless (or (string= src-tfile "no")
                         (and tangle-file (not (equal tangle-file src-tfile)))
                         (and language (not (string= language src-lang)))
                         (and exclude-file (string= exclude-file src-tfile)))
               ;; Add the spec for this block to blocks under its
               ;; language.
               (let ((by-lang (assoc src-lang blocks))
                     (block (org-babel-tangle-single-block counter)))
                 (if by-lang (setcdr by-lang (cons block (cdr by-lang)))
                   (push (cons src-lang (list block)) blocks)))))))
       ;; Ensure blocks are in the correct order.
       (mapcar (lambda (b) (cons (car b) (nreverse (cdr b))))
               (nreverse blocks))))
   #+END_SRC
  
*** vrp-org-babel-tangle-not-tests
**** description
     This function tangles all the src blocks in the file except those that should be tangled to the file passed in the optional arg excluded-file.  This arg defaults to "src/vrp-tests.lisp".  Other than that, it is exactly org-babel-tangle.

     It is taken from ob-tangle.el from org version 9.2.
