vrp-emacs-utils.el
(font-lock-add-keywords 'lisp-mode
 '(("(\\(defmacro!\\)" 1 font-lock-keyword-face)
   ("(defmacro! +\\([^ ]+\\)" 1 font-lock-function-name-face)
   ("(\\(defbehavior\\)" 1 font-lock-keyword-face)
   ("(defbehavior +\\([^ ]+\\)" 1 font-lock-function-name-face)
   ("(\\(then\\)" 1 font-lock-keyword-face)
   ("(\\(else\\)" 1 font-lock-keyword-face)
   ("(\\(the-following\\)" 1 font-lock-keyword-face)))

(defun vrp-org-babel-tangle-collect-blocks-no-tests
    (&optional language tangle-file exclude-file)
  "Collect source blocks in the current Org file, excluding blocks
tangled to exclude-file.
Return an association list of source-code block specifications of
the form used by `org-babel-spec-to-string' grouped by language.
Optional argument LANGUAGE can be used to limit the collected
source code blocks by language.  Optional argument TANGLE-FILE
can be used to limit the collected code blocks by target file."
  (setq exclude-file (or exclude-file "../src/vrp-tests.lisp"))
  (let ((counter 0) last-heading-pos blocks)
    (org-babel-map-src-blocks (buffer-file-name)
      (let ((current-heading-pos
             (org-with-wide-buffer
              (org-with-limited-levels (outline-previous-heading)))))
        (if (eq last-heading-pos current-heading-pos) (cl-incf counter)
          (setq counter 1)
          (setq last-heading-pos current-heading-pos)))
      (unless (org-in-commented-heading-p)
        (let* ((info (org-babel-get-src-block-info 'light))
               (src-lang (nth 0 info))
               (src-tfile (cdr (assq :tangle (nth 2 info)))))
          (unless (or (string= src-tfile "no")
                      (and tangle-file (not (equal tangle-file src-tfile)))
                      (and language (not (string= language src-lang)))
                      (and exclude-file (string= exclude-file src-tfile)))
            ;; Add the spec for this block to blocks under its
            ;; language.
            (let ((by-lang (assoc src-lang blocks))
                  (block (org-babel-tangle-single-block counter)))
              (if by-lang (setcdr by-lang (cons block (cdr by-lang)))
                (push (cons src-lang (list block)) blocks)))))))
    ;; Ensure blocks are in the correct order.
    (mapcar (lambda (b) (cons (car b) (nreverse (cdr b))))
            (nreverse blocks))))

(defun vrp-org-babel-tangle-no-tests
