vrp/vrp-suite.org
**** code
    #+BEGIN_SRC emacs-lisp :results none :exports code :tangle ../vrp-emacs-utils.el
      (defvar vrp-tangle-list
	`("vrp-suite.org"
	  "vrp-classes.org"
	  "vrp-moments.org"
	  "vrp-data.org"
	  "vrp-neighborhood-exploration-macros.org"
	  "vrp-neighborhood-simulation.org"
	  "vrp-neighborhood-operations.org"
	  "vrp-delta-cost.org"
	  "vrp-search-strategies.org"
	  "vrp-criteria.org"
	  "vrp-algorithms.org"

	  "neigh-class-macros.org"
	  "neigh-classes.org"
	  "neigh-criterion.org"
	  "neigh-compatibility.org"
	  "neigh-cardinality.org"
	  "neigh-indexer.org"
	  "neigh-exploration.org"
	  "neigh-statistics.org"
	  "neigh-exploration-heuristics.org"
	  "neigh-data.org"
	  "neigh-search-strategies.org"
	  "neigh-algorithms.org")
	"A list with all the files that should be tangled.")
    #+END_SRC
     
*** code (newer with py-org-babel-tangle)
    #+BEGIN_SRC shell :results none :exports code
    for f in vrp-suite.org vrp-classes.org vrp-moments.org vrp-data.org vrp-neighborhood-exploration-macros.org vrp-neighborhood-simulation.org vrp-neighborhood-operations.org vrp-delta-cost.org vrp-search-strategies.org vrp-algorithms.org;
    do ./vrp-py-babel-tangle.sh $f;
    done;
    #+END_SRC
   
*** code (new no tests)
    #+BEGIN_SRC emacs-lisp :results none :exports code :tangle ../vrp-emacs-utils.el
    (defun vrp-tangle-all-files ()
      "Tangles all the required files for the vrp-suite."
      (interactive)
      (dolist (file vrp-tangle-list)
        ;; (log-to-buffer "%s" file)
        (vrp-org-babel-tangle-file-no-tests file)))
    #+END_SRC
   
*** code (old with tests)
    #+BEGIN_SRC emacs-lisp :results none :exports code :tangle ../vrp-emacs-utils.el
    (defun vrp-tangle-all-files-with-tests ()
      "Tangles all the required files for the vrp-suite."
      (interactive)
      (dolist (file vrp-tangle-list)
        (org-babel-tangle-file file)))
    #+END_SRC
   
** Emacs function to change to the journal
   The heading should be descriptive enough.
   #+BEGIN_SRC emacs-lisp :results none :exports code :tangle ../vrp-emacs-utils.el
   (defun vrp-switch-to-journal-other-frame ()
     "Pops up the journal on another frame."
     (interactive)
     (switch-to-buffer-other-frame "vrp-journal.org"))
   #+END_SRC
** Emacs function to change to the repl in other window
   The heading should be descriptive enough.
   #+BEGIN_SRC emacs-lisp :results none :exports code :tangle ../vrp-emacs-utils.el
   (defun vrp-switch-to-repl-other-window ()
     "Goes to the next window and pops the REPL."
     (interactive)
     (switch-to-buffer-other-window "*slime-repl sbcl*"))
   #+END_SRC
** Emacs keybindings for vrp
   #+BEGIN_SRC emacs-lisp :results none :exports code :tangle ../vrp-emacs-utils.el
   ;; (define-key org-mode-map (kbd "M-m M-v") (make-sparse-keymap))
   ;; (define-key org-mode-map (kbd "M-m M-v j") 'vrp-switch-to-journal-other-frame)
   ;; (define-key org-mode-map (kbd "M-m M-v M-j") 'vrp-switch-to-journal-other-frame)
   ;; ;; keys to change to the repl in the other window
   ;; (define-key org-mode-map (kbd "M-m M-v r") 'vrp-switch-to-repl-other-window)
   ;; (define-key org-mode-map (kbd "M-m M-v M-r") 'vrp-switch-to-repl-other-window)
   ;; (define-key lisp-mode-map (kbd "M-m M-o r") 'vrp-switch-to-repl-other-window)
   ;; (define-key lisp-mode-map (kbd "M-m M-o M-r") 'vrp-switch-to-repl-other-window)
   ;; ;; key to insert (load everything.lisp) in the repl
   ;; (define-key lisp-mode-map (kbd "M-m M-o M-l") (lambda () (interactive) (insert "(load \"src/vrp-load-files.lisp\") (in-package :vrp) (load \"src/neigh-load-files.lisp\")")))
   #+END_SRC
   
* TODO The unit-testing framework
** documentation
   In this section we add a unit-testing framework tailored for our needs.
** code
*** adding the package
**** code
     #+BEGIN_SRC lisp +n -r :results none :exports code :tangle ../src/vrp-unit-testing.lisp 
     (in-package :vrp)
     #+END_SRC
     
*** defvar *vrp-unit-testing-indent*
**** documentation
     A global variable to determine the appropriate indentation when printing the results of the tests
**** code
     #+BEGIN_SRC lisp +n -r :results none :exports code :tangle ../src/vrp-unit-testing.lisp 
     (defparameter *vrp-unit-testing-indent* 3
       "The indentation that should be used when printing the results of the tests.")
     #+END_SRC
     
*** defvar *vrp-unit-testing-display-results*
**** documentation
     A global variable to determine whether or not to print the results of the test.
**** code
     #+BEGIN_SRC lisp +n -r :results none :exports code :tangle ../src/vrp-unit-testing.lisp 
     (defparameter *vrp-unit-testing-display-results* t
       "Whether or not to print the result of the tests.")
     #+END_SRC
*** defvar *vrp-unit-testing-display-output*
**** documentation
     A global variable to determine whether or not to print the output information of the tests.
**** code
     #+BEGIN_SRC lisp +n -r :results none :exports code :tangle ../src/vrp-unit-testing.lisp 
     (defparameter *vrp-unit-testing-display-output* t
       "Whether or not to print the output information of the tests.")
     #+END_SRC
*** check-t
**** documentation
     A function to test something that should return t.
**** code
     #+BEGIN_SRC lisp +n -r :results none :exports code :tangle ../src/vrp-unit-testing.lisp 
     (defmacro check-t (form)
       `(let* ((result ,form)
               (display-form ',form))
          (progn
            (if *vrp-unit-testing-display-results*
                (format t "~vt~:[FAIL~;pass~]"
                        *vrp-unit-testing-indent*
                        result))
            (if *vrp-unit-testing-display-output*
                (format t " ... Check ~a:  ~30t~a~%"
                        T display-form))
            (if (and *vrp-unit-testing-display-results*
                     (not *vrp-unit-testing-display-output*))
                (format t "~%"))
            result)))
     #+END_SRC
**** code (original)
     #+BEGIN_SRC lisp +n -r :results none :exports code 
     (defmacro check-t (form)
       `(let* ((result ,form))
          (progn
            (if *vrp-unit-testing-display-output*
                (format t "~vt~:[FAIL~;pass~] ... Check T:   ~30t~a~%"
                     ,*vrp-unit-testing-indent*
                     result ',form))
            result)))
     #+END_SRC
**** tests
     #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp 
     (print (check-t (= 2 (+ 1 1))))
     (print (check-t (= 2 (+ 1 3))))

     (let* ((*vrp-unit-testing-indent* 6))
       (check-t (= 4 (+ 1 3))))
     #+END_SRC
*** check-non-nil
**** documentation
     A function to test something that should return non nil
**** code
     #+BEGIN_SRC lisp +n -r :results none :exports code :tangle ../src/vrp-unit-testing.lisp 
     (defmacro check-non-nil (form)
       `(let* ((result ,form))
          (progn
            (if *vrp-unit-testing-display-output*
                (format t "~vt~:[FAIL~;pass~] ... Check non NIL:   ~30t~a~%"
                     ,*vrp-unit-testing-indent*
                     result ',form))
            result)))
     #+END_SRC
**** tests
     #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp 
     (print (check-t (= 2 (+ 1 1))))
     (print (check-t (= 2 (+ 1 3))))

     (let* ((*vrp-unit-testing-indent* 6))
       (check-t (= 4 (+ 1 3))))
     #+END_SRC
*** check-nil
**** documentation
     A function to test something that should return nil
**** code
     #+BEGIN_SRC lisp +n -r :results none :exports code :tangle ../src/vrp-unit-testing.lisp 
     (defmacro check-nil (form)
       `(let* ((result (not ,form))
               (display-form ',form))
          (progn
            (if *vrp-unit-testing-display-results*
                (format t "~vt~:[FAIL~;pass~]"
                        *vrp-unit-testing-indent*
                        result))
            (if *vrp-unit-testing-display-output*
                (format t " ... Check ~a:  ~30t~a~%"
                        NIL display-form))
            (if (and *vrp-unit-testing-display-results*
                     (not *vrp-unit-testing-display-output*))
                (format t "~%"))
            result)))
     #+END_SRC
**** +code (original)+
     #+BEGIN_SRC lisp +n -r :results none :exports code 
     (defmacro check-nil (form)
       `(let* ((result ,form))
          (progn
            (if *vrp-unit-testing-display-output*
                (format t "~vt~:[pass~;FAIL~] ... Check NIL: ~30t~a~%"
                     ,*vrp-unit-testing-indent*
                     result ',form))
            (not result))))
     #+END_SRC
**** tests
     #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp 
     (print (check-nil (= 3 (+ 1 1))))
     (print (check-nil (= 2 (+ 1 3))))
     #+END_SRC
*** defmacro make-test
**** documentation
     From here on, all the check macros have the same structure.  I decided to abstract that into a macro called =make-check=.
     This macro creates a function of the form =check-something=.  It will be used to create the checks in the unit testing.
**** code
     #+BEGIN_SRC lisp +n -r :results none :exports code :tangle ../src/vrp-unit-testing.lisp 
     (defmacro make-check (name operator)
       (let* ((macro-name (symb 'check- name)))
         `(defmacro ,macro-name (value form)
              `(let* ((result (,',operator ,value ,form))
                      (display-form ',form))
                (progn
                  (if *vrp-unit-testing-display-results*
                      (format t "~vt~:[FAIL~;pass~]"
                              ,*vrp-unit-testing-indent*
                              result))
                  (if *vrp-unit-testing-display-output*
                      (format t " ... Check ~a:  ~30t~a~%"
                              ,value display-form))
                  (if (and *vrp-unit-testing-display-results*
                           (not *vrp-unit-testing-display-output*))
                      (format t "~%"))
                  result)))))
     #+END_SRC
**** tests
***** testing macroexpand
      #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp 
      (pp-expand (make-check str= string=))
      #+END_SRC

*** check-=
**** documentation
     A function to test something that should return a given number
**** code (without make-test)
     #+BEGIN_SRC lisp +n -r :results none :exports code 
     (defmacro check-= (value form)
       `(let* ((result (= ,value ,form)))
          (progn
            (if *vrp-unit-testing-display-output*
                (format t "~vtCheck ~a: ~20t~:[FAIL~;pass~] ... ~a~%"
                        ,*vrp-unit-testing-indent*
                        ,value
                        result ',form))
            result)))
     #+END_SRC
**** code (with make-test)
     #+BEGIN_SRC lisp +n -r :results none :exports code :tangle ../src/vrp-unit-testing.lisp
     (make-check = =)
     #+END_SRC
**** tests
***** test with all the output
      #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp 
      (check-= 2 (+ 1 1))
      (check-= 4 (+ 1 3))
      (check-= 6 (+ 1 3))
      #+END_SRC

***** test without the output
      #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp 
      (let* ((*vrp-unit-testing-display-output* nil))
        (check-= 2 (+ 1 1))
        (check-= 4 (+ 1 3))
        (check-= 6 (+ 1 3)))
      #+END_SRC

***** test without any output
      #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp 
      (let* ((*vrp-unit-testing-display-results* nil)
             (*vrp-unit-testing-display-output* nil))
        (check-= 2 (+ 1 1))
        (check-= 4 (+ 1 3))
        (check-= 6 (+ 1 3)))
      #+END_SRC
*** check-eq
**** documentation
     A function to test something that should return a given number
**** code (without make-test)
     #+BEGIN_SRC lisp +n -r :results none :exports code 
     (defmacro check-eq (value form)
       `(let* ((result (eq ,value ,form)))
          (progn
            (if *vrp-unit-testing-display-output*
                (format t "~vtCheck ~a: ~20t~:[FAIL~;pass~] ... ~a~%"
                        ,*vrp-unit-testing-indent*
                        ,value
                        result ',form))
            result)))
     #+END_SRC
**** code (with make-test)
     #+BEGIN_SRC lisp +n -r :results none :exports code :tangle ../src/vrp-unit-testing.lisp
     (make-check eq eq)
     #+END_SRC
**** tests
     #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp 
     (check-eq 'd 'd)
     (check-eq 'hello "hello")
     #+END_SRC
     
*** check-str=
**** documentation
     A function to test something that should return a given string.
**** code (without make-test)
     #+BEGIN_SRC lisp +n -r :results none :exports code 
     (defmacro check-str= (value form)
       `(let* ((result (string= ,value ,form)))
          (progn
            (if *vrp-unit-testing-display-output*
                (format t "~vtCheck ~a: ~20t~:[FAIL~;pass~] ... ~a~%"
                        ,*vrp-unit-testing-indent*
                        ,value
                        result ',form))
            result)))
     #+END_SRC
**** code (with make-test)
     #+BEGIN_SRC lisp +n -r :results none :exports code :tangle ../src/vrp-unit-testing.lisp
     (make-check str= string=)
     #+END_SRC
**** tests
     #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp 
     (check-str= "d" "d")
     (check-str= "hello" (format nil "he~a" "llo"))
     #+END_SRC
     
*** check-list=
