vrp-emacs-utils.el

(defvar vrp-tangle-list
  `("vrp-suite.org"
    "vrp-classes.org"
    "vrp-moments.org"
    "vrp-data.org"
    "vrp-neighborhood-exploration-macros.org"
    "vrp-neighborhood-simulation.org"
    "vrp-neighborhood-operations.org"
    "vrp-delta-cost.org"
    "vrp-search-strategies.org"
    "vrp-criteria.org"
    "vrp-algorithms.org"

    "neigh-class-macros.org"
    "neigh-classes.org"
    "neigh-criterion.org"
    "neigh-compatibility.org"
    "neigh-cardinality.org"
    "neigh-indexer.org"
    "neigh-exploration.org"
    "neigh-statistics.org"
    "neigh-exploration-heuristics.org"
    "neigh-data.org"
    "neigh-search-strategies.org"
    "neigh-algorithms.org")
  "A list with all the files that should be tangled.")

(defun vrp-tangle-all-files ()
  "Tangles all the required files for the vrp-suite."
  (interactive)
  (dolist (file vrp-tangle-list)
    ;; (log-to-buffer "%s" file)
    (vrp-org-babel-tangle-file-no-tests file)))

(defun vrp-tangle-all-files-with-tests ()
  "Tangles all the required files for the vrp-suite."
  (interactive)
  (dolist (file vrp-tangle-list)
    (org-babel-tangle-file file)))

(defun vrp-switch-to-journal-other-frame ()
  "Pops up the journal on another frame."
  (interactive)
  (switch-to-buffer-other-frame "vrp-journal.org"))

(defun vrp-switch-to-repl-other-window ()
  "Goes to the next window and pops the REPL."
  (interactive)
  (switch-to-buffer-other-window "*slime-repl sbcl*"))

;; (define-key org-mode-map (kbd "M-m M-v") (make-sparse-keymap))
;; (define-key org-mode-map (kbd "M-m M-v j") 'vrp-switch-to-journal-other-frame)
;; (define-key org-mode-map (kbd "M-m M-v M-j") 'vrp-switch-to-journal-other-frame)
;; ;; keys to change to the repl in the other window
;; (define-key org-mode-map (kbd "M-m M-v r") 'vrp-switch-to-repl-other-window)
;; (define-key org-mode-map (kbd "M-m M-v M-r") 'vrp-switch-to-repl-other-window)
;; (define-key lisp-mode-map (kbd "M-m M-o r") 'vrp-switch-to-repl-other-window)
;; (define-key lisp-mode-map (kbd "M-m M-o M-r") 'vrp-switch-to-repl-other-window)
;; ;; key to insert (load everything.lisp) in the repl
;; (define-key lisp-mode-map (kbd "M-m M-o M-l") (lambda () (interactive) (insert "(load \"src/vrp-load-files.lisp\") (in-package :vrp) (load \"src/neigh-load-files.lisp\")")))
